In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('~/JProjects/vma/data/titanic.csv')

In [3]:
data.head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [6]:
data[data['Age'].isnull()].head()

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0
14            Baumann, Mr John D    1st  NaN    male         0        0
29       Borebank, Mr John James    1st  NaN    male         0        0
32            Bradley, Mr George    1st  NaN    male         1        0

In [7]:
data['Sex'].replace('male', NaN)

NameError: name 'NaN' is not defined

In order to manipulate with NaN objects we need to use Numpy

In [8]:
import numpy as np

data['Sex'].replace('male', np.nan).head()

0    female
1    female
2       NaN
3    female
4       NaN
Name: Sex, dtype: object